{
  "model_id": "runwayml/stable-diffusion-v1-5",
  "effective_lora": {
    "unet": {
      "default": {
        "task_type": "FEATURE_EXTRACTION",
        "peft_type": "LORA",
        "auto_mapping": null,
        "base_model_name_or_path": null,
        "revision": null,
        "inference_mode": false,
        "r": 16,
        "target_modules": [
          "to_k",
          "to_out.0",
          "to_q",
          "to_v"
        ],
        "exclude_modules": null,
        "lora_alpha": 16,
        "lora_dropout": 0.0,
        "fan_in_fan_out": false,
        "bias": "none",
        "use_rslora": false,
        "modules_to_save": null,
        "init_lora_weights": true,
        "layers_to_transform": null,
        "layers_pattern": null,
        "rank_pattern": {},
        "alpha_pattern": {},
        "megatron_config": null,
        "megatron_core": "megatron.core",
        "trainable_token_indices": null,
        "loftq_config": {},
        "eva_config": null,
        "corda_config": null,
        "use_dora": false,
        "use_qalora": false,
        "qalora_group_size": 16,
        "layer_replication": null,
        "lora_bias": false,
        "target_parameters": null
      }
    },
    "text_encoder": {
      "default": {
        "task_type": "FEATURE_EXTRACTION",
        "peft_type": "LORA",
        "auto_mapping": null,
        "base_model_name_or_path": "/home/hpc/v123be/v123be29/.cache/huggingface/hub/models--runwayml--stable-diffusion-v1-5/snapshots/451f4fe16113bff5a5d2269ed5ad43b0592e9a14/text_encoder",
        "revision": null,
        "inference_mode": false,
        "r": 16,
        "target_modules": [
          "k_proj",
          "out_proj",
          "q_proj",
          "v_proj"
        ],
        "exclude_modules": null,
        "lora_alpha": 16,
        "lora_dropout": 0.0,
        "fan_in_fan_out": false,
        "bias": "none",
        "use_rslora": false,
        "modules_to_save": null,
        "init_lora_weights": true,
        "layers_to_transform": null,
        "layers_pattern": null,
        "rank_pattern": {},
        "alpha_pattern": {},
        "megatron_config": null,
        "megatron_core": "megatron.core",
        "trainable_token_indices": null,
        "loftq_config": {},
        "eva_config": null,
        "corda_config": null,
        "use_dora": false,
        "use_qalora": false,
        "qalora_group_size": 16,
        "layer_replication": null,
        "lora_bias": false,
        "target_parameters": null
      }
    }
  },
  "trainable_params_total": 4368384,
  "optimizer_lr_groups": [
    0.002,
    1e-05
  ],
  "weight_decay_groups": [
    0.0,
    0.0
  ]
}